<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 中间件配置
// +----------------------------------------------------------------------
return [
    // 默认中间件命名空间
    'default_namespace' => 'app\\http\\middleware\\',

    //  全局中间件
    'GlobalCheck',

    //  注册路由中间件（为同一条路由绑定，多个中间件）
    'testMyMid_1' => 'app\http\middleware\CheckTestMiddleware_1',
    'testMyMid_2' => 'app\http\middleware\CheckTestMiddleware_2',

];
